app/controllers/articles_controller.rb

INSERT INTO "articles" ("created_at", "title", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-07-23 16:41:55.013286"], ["title", "stuff"], ["updated_at", "2014-07-23 16:41:55.013286"]]
---
 def create
    #render plain: params[:article].inspect
    @article = Article.new(article_params)

    if @article.save